In [140]:
import pandas as pd
import numpy as np

In [141]:
df = pd.read_csv('Water_data.txt')

In [142]:
df

   float    month   counter   pre_counter
0      2        3      3578          3509
1      3        3      3678          3509
2      5        4      3789          3490
3      2        4      3878          3578
4      3        4      3978          3578
5      5        5      4089          3889

In [143]:
df['quantity'] = df[' counter'] - df[' pre_counter']

In [144]:
df

   float    month   counter   pre_counter  quantity
0      2        3      3578          3509        69
1      3        3      3678          3509       169
2      5        4      3789          3490       299
3      2        4      3878          3578       300
4      3        4      3978          3578       400
5      5        5      4089          3889       200

In [145]:
p=7.05

In [146]:

df['value'] = df['quantity']* p

df

   float    month   counter   pre_counter  quantity    value
0      2        3      3578          3509        69   486.45
1      3        3      3678          3509       169  1191.45
2      5        4      3789          3490       299  2107.95
3      2        4      3878          3578       300  2115.00
4      3        4      3978          3578       400  2820.00
5      5        5      4089          3889       200  1410.00

In [147]:
f = int(input("Enter float: "))
dt=df.loc[df['float']== f]#[value].sum()
dt

Enter float:  1

Empty DataFrame
Columns: [float,   month,  counter,  pre_counter, quantity, value]
Index: []